/*
Внутри класса Answer напишите методы CreateIncreasingMatrix, PrintArray, FindNumberByPosition и PrintCheckIfError.

Метод CreateIncreasingMatrix должен создавать матрицу заданной размерности,
с каждым новым элементом увеличивающимся на опрделенное число. Метод принимает на вход три числа
(n - количество строк матрицы, m - количество столбцов матрицы, k - число, на которое увеличивается каждый новый элемент)
и возвращает матрицу, удовлетворяющую этим условиям.

Метод PrintArray должен выводить на экран сгенерированную методом CreateIncreasingMatrix матрицу.

Метод FindNumberByPosition принимает на вход сгенрированную матрицу и числа x и y - позиции элемента в матрице.
Если указанные координаты находятся за пределами границ массива, метод должен вернуть массив с нулевым значением.
Если координаты находятся в пределах границ, метод должен вернуть массив с двумя значениями: значением числа в указанной позиции,
а второй элемент должен быть равен 0, чтобы показать, что операция прошла успешно без ошибок.

Метод PrintCheckIfError должен принимать результат метода FindNumberByPosition и числа x и y - позиции элемента в матрице.
Метод должен проверить, был ли найден элемент в матрице по указанным координатам (x и y), используя результаты
из метода FindNumberByPosition. Если такого элемента нет, вывести на экран "There is no such index".
Если элемент есть, вывести на экран "The number in [{x}, {y}] is {значение}".
*/
